[
  { "text": "Why stay in a place that thinks 'work-life balance' is a cute slogan, not an actual practice? I'm done being their 24/7 workhorse.", "author": "Anonymous" },
  { "text": "I don’t need to deal with a boss whose only skill is making everyone else miserable. Leadership? More like dictatorship.", "author": "Anonymous" },
  { "text": "I’m not here to set myself on fire to keep this dumpster fire of a company warm. They can burn on their own.", "author": "Anonymous" },
  { "text": "Breaking my back for crumbs while others get promotions for breathing? No thanks, I know my worth.", "author": "Anonymous" },
  { "text": "Oh, the ‘growth opportunities’ they promised? A lie. The only growth here is in my frustration.", "author": "Anonymous" },
  { "text": "Every day here feels like a new level of hell. There’s no organization, no direction—just chaos pretending to be innovation.", "author": "Anonymous" },
  { "text": "I'm tired of getting paid peanuts while they demand gold-standard performance. They can find another fool.", "author": "Anonymous" },
  { "text": "Why should I stay and deal with people who’d rather sabotage than support? Life's too short for workplace drama.", "author": "Anonymous" },
  { "text": "If they wanted a robot to do everything their way, they should’ve hired one. I'm not here to be a puppet.", "author": "Anonymous" },
  { "text": "This place has no direction, no ambition, and no clue. Staying here would be career ender.", "author": "Anonymous" },
  { "text": "Oh sure, 'work-life balance' is totally a thing here—if your life revolves around work 24/7. Love being their tireless little hamster.", "author": "Anonymous" },
  { "text": "Leadership here? Absolutely inspiring. Nothing says 'visionary' like a boss whose greatest talent is ruining everyone’s day.", "author": "Anonymous" },
  { "text": "Oh, I just adore setting myself on fire to keep this company warm. It's not like I had personal goals or dreams anyway.", "author": "Anonymous" },
  { "text": "It’s so rewarding to watch others get promoted for existing while I break my back. Truly, this must be what job satisfaction feels like.", "author": "Anonymous" },
  { "text": "Ah yes, the 'growth opportunities' here are incredible—if you mean growing my tolerance for disappointment.", "author": "Anonymous" },
  { "text": "Every day here is a new adventure in chaos. Who needs structure or a plan when we can just wing it and call it 'innovation'?", "author": "Anonymous" },
  { "text": "Getting paid in peanuts while delivering gold-standard work is honestly so humbling. Who needs money when you can have corporate 'appreciation'?", "author": "Anonymous" },
  { "text": "Oh, the camaraderie is unmatched—especially when everyone’s more focused on sabotage than support. Feels like high school all over again!", "author": "Anonymous" },
  { "text": "Micromanagement? My favorite! I just love being treated like I can’t be trusted to tie my own shoes.", "author": "Anonymous" },
  { "text": "Staying here feels like such a smart move—if your goal is to end up with zero ambition and a mountain of regret.", "author": "Anonymous" },
  { "text": "Every day is a gift. Too bad this job feels like regifting the same pair of socks.", "author": "Anonymous" },
  { "text": "Teamwork makes the dream work… if your dream is constant micromanagement and endless meetings.", "author": "Anonymous" },
  { "text": "They say, 'Do what you love, and you'll never work a day in your life.' So I guess I really hate this.", "author": "Anonymous" },
  { "text": "I’d leave right now, but I want to give my coworkers the joy of one more eye-roll today.", "author": "Anonymous" },
  { "text": "Why quit when I can stay here and perfect the art of looking busy while doing nothing?", "author": "Anonymous" },
  { "text": "The pay isn’t great, but at least the stress is unbearable.", "author": "Anonymous" },
  { "text": "I don’t work here for the money. I work here for the daily character-building exercises.", "author": "Anonymous" },
  { "text": "Quitting feels like winning the lottery, except you don’t get any money—just peace of mind.", "author": "Anonymous" },
  { "text": "Why quit when I could stay here and slowly die inside instead?", "author": "Anonymous" },
  { "text": "Every time I think about quitting, I remember I need a paycheck. Then I cry.", "author": "Anonymous" },
  { "text": "I’m not saying I hate my job, but if it were on fire, I’d bring marshmallows.", "author": "Anonymous" },
  { "text": "This job is like a toxic relationship: I don’t want to be here, but I can’t afford to leave.", "author": "Anonymous" },
  { "text": "I have a great boss. They're great at making me question every life choice I’ve ever made.", "author": "Anonymous" },
  { "text": "Some people climb the corporate ladder. I’m over here just trying to find the fire escape.", "author": "Anonymous" },
  { "text": "I stayed up all night thinking about quitting. Then I remembered that sleep deprivation was on-brand for this job.", "author": "Anonymous" },
  { "text": "They said, 'Be grateful you have a job.' I said, 'I am—grateful for the exit door.'", "author": "Anonymous" },
  { "text": "Quitting is easy. It’s figuring out how to survive after that’s the hard part.", "author": "Anonymous" },
  { "text": "I don't dream of labor; I dream of logging out and never logging back in.", "author": "Anonymous" },
  { "text": "This job taught me patience. Mainly because I’m patiently waiting to quit.", "author": "Anonymous" },
  { "text": "My boss inspires me every day—to update my resume.", "author": "Anonymous" }
]
